; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared4 - mode
	infrared2 - mode
	thermograph0 - mode
	image1 - mode
	image3 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation8 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star10 - direction
	Star11 - direction
	Star7 - direction
	Star9 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star11)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image1)
	(supports instrument2 infrared4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star11)
	(calibration_target instrument2 Star10)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Phenomenon14 image3)
	(have_image Planet15 image3)
	(have_image Star16 thermograph0)
	(have_image Star17 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 5
2. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 0 of 5
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
4. (calibrate satellite0 instrument1 star11)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite0 phenomenon14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 5
6. (take_image satellite0 phenomenon14 instrument1 image3)
   added: (have_image phenomenon14 image3)
   goals met: 1 of 5
7. (turn_to satellite0 groundstation5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation5)
   goals met: 1 of 5
8. (turn_to satellite0 planet15 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 planet15)
   goals met: 1 of 5
9. (take_image satellite0 planet15 instrument1 image3)
   added: (have_image planet15 image3)
   goals met: 2 of 5
10. (turn_to satellite0 groundstation5 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 5
11. (turn_to satellite0 star17 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star17)
   goals met: 2 of 5
12. (take_image satellite0 star17 instrument1 infrared2)
   added: (have_image star17 infrared2)
   goals met: 3 of 5
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 3 of 5
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 5
15. (turn_to satellite0 groundstation6 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 5
16. (turn_to satellite0 groundstation8 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation8)
   goals met: 3 of 5
17. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 3 of 5
18. (turn_to satellite0 groundstation6 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 groundstation6)
   goals met: 4 of 5
19. (turn_to satellite0 star16 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
20. (take_image satellite0 star16 instrument0 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 4 of 5
21. (turn_to satellite0 groundstation6 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation6)
   goals met: 5 of 5
